# -*- coding: utf-8 -*-

# (цикл while)

# Ежемесячная стипендия студента составляет educational_grant руб., а расходы на проживание превышают стипендию
# и составляют expenses руб. в месяц. Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца
# Составьте программу расчета суммы денег, которую необходимо единовременно попросить у родителей,
# чтобы можно было прожить учебный год (10 месяцев), используя только эти деньги и стипендию.
# Формат вывода:
#   Студенту надо попросить ХХХ.ХХ рублей

educational_grant, expenses = 10000, 12000

parents_loan = expenses - educational_grant
count = 0
while count < 9:
    count += 1
    expenses *= 1.03 # можно так
    parents_loan += expenses - educational_grant
else:
    print("Студенту надо попросить", round(parents_loan, 2), "рублей")

# зачет!
