# Составить отдельный модуль mastermind_engine, реализующий функциональность игры.
# В mastermind_engine нужно реализовать функции:
#   загадать_число()
#   проверить_число(NN) - возвращает словарь {'bulls': N, 'cows': N}
# Загаданное число хранить в глобальной переменной.
# Обратите внимание, что строки - это список символов.
#
# В текущем модуле (lesson_006/01_mastermind.py) реализовать логику работы с пользователем:
#   модуль движка загадывает число
#   в цикле, пока число не отгадано
#       у пользователя запрашивается вариант числа
#       проверяем что пользователь ввел допустимое число (4 цифры, все цифры разные, не начинается с 0)
#       модуль движка проверяет число и выдает быков/коров
#       результат быков/коров выводится на консоль
#  когда игрок угадал таки число - показать количество ходов и вопрос "Хотите еще партию?"
import random

_holder = []


def guess_number():
    global _holder
    _holder = []
    number_list = list(range(1, 9))
    random.shuffle(number_list)
    _holder.append(number_list[:4])


def predict(number):
    cows = 0
    bulls = 0
    for i in range(4):
        if str(number[i]) == str(_holder[i]):
            bulls += 1
        elif (number[i]) in str(_holder):
            cows += 1
            return cows, bulls

