# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...


from room_1 import folks as f1
from room_2 import folks as f2
print("В комнате room1 живут", f1)
print("в комнате room_2 живут", f2)
# Зачет!