# -*- coding: utf-8 -*-
import simple_draw as sd
sd.resolution = (1200, 1000)


from lesson_005.landscape.house import wall, window, roof
from lesson_005.landscape.sky_objects import sun, rainbow
from lesson_005.landscape.smile import smile
from lesson_005.landscape.snow import snow
from lesson_005.landscape.tree_ground import tree


# Создать пакет, в который скопировать функции отрисовки из предыдущего урока
#  - радуги
#  - стены
#  - дерева
#  - смайлика
#  - снежинок
# Функции по модулям разместить по тематике. Название пакета и модулей - по смыслу.
# Создать модуль с функцией отрисовки кирпичного дома с широким окном и крышей.

# С помощью созданного пакета нарисовать эпохальное полотно "Утро в деревне".
# На картине должны быть:
#  - кирпичный дом, в окошке - смайлик.
#  - слева от дома - сугроб (предположим что это ранняя весна)
#  - справа от дома - дерево (можно несколько)
#  - справа в небе - радуга, слева - солнце (весна же!)
# пример см. lesson_005/results/04_painting.jpg
# Приправить своей фантазией по вкусу (коты? коровы? люди? трактор? что придумается)

snow()
tree(point=sd.get_point(1000, 30), angle=90, length=65, color=(127, 63, 0))
wall()
window()
roof()
sun()
rainbow()
smile(650, 150)
# Усложненное задание (делать по желанию)
# Анимировать картину.
# Пусть слева идет снегопад, радуга переливается цветами, смайлик моргает, солнце крутит лучами, етс.
# Задержку в анимировании все равно надо ставить, пусть даже 0.01 сек - так библиотека устойчивей работает.
sd.pause()
